cases/PR1.5/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101352.93;

boundaryField
{
    engineInlet
    {
        type            totalPressure;
        rho             none;
        psi             psi;
        gamma           1.4;
        p0              uniform 152029.3950000000;
        value           uniform 101352.93;
    }

    freestreamInlet
    {
        type            freestreamPressure;
        freestreamValue uniform 101352.93;
        supersonic      false;
        value           uniform 101352.93;
    }

    outlet
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        101352.93;
        lInf            1;
        value           uniform 101352.93;
    }

    internalNozzleWall
    {
        type            zeroGradient;
    }

    externalNozzleWall
    {
        type            zeroGradient;
    }

    topSlip
    {
        type            zeroGradient;
    }

    axis
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
